hours = int(input())
minutes = int(input())
# един час има 60 минути , които се умножават по часовете и след товасе прибавят минутите, за да се получи общият сбор на минутите.
now_in_minutes = hours * 60 + minutes # преобразуване всичко в минути (трябва да работим в една мерна единица - минути)
time_after_15_minutes = now_in_minutes + 15 # после прибавяме 15 минути към предните минути
final_hour = time_after_15_minutes // 60 # предобразуваме минутите обратно в часове, с целочислено деление
# , при което ще остане резултата от делението само преди десетичната запетая
final_minutes = time_after_15_minutes % 60 # обръщаме минутите в минути с деление на модул,
#, което ще ни извади само резултата само след десетичната запетая.
# условие, което проверява дали минутите са под 10 и ако ДА, да се сложи 0 пред минутите
if final_minutes < 10:
    print(f'{final_hour}:0{final_minutes}')
# условие, ако часът е равен на 24 да се промени на 00
if final_hour == 24:
    final_hour = 0
    print(f'{final_hour}:{final_minutes}')
